StoveOpt/mesh_test/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application reactingFoam;

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 10;

deltaT 0.001;

writeControl adjustableRunTime;

writeInterval 0.5;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

writeCompression off;

timeFormat general;

timePrecision 6;

runTimeModifiable true;

adjustTimeStep yes;

maxCo 0.4;

functions
{
probes
{
functionObjectLibs ( "libsampling.so" );

type probes;

name probes;

outputControl outputTime;
outputInterval 1;

fields
(
T
);

probeLocations
(
(0 -0.07 0.25)
(0 -0.04 0.25)
(0 -0.07 0.15)
(0 -0.07 0.18)
(0 -0.04 0.15)
(0 -0.04 0.18)
(0 0 0.18)
(0 0 0.15)
(0 0.15 0.18)
(0 0.15 0.15)
(0 0.19 0.15)
(0 0.19 0.18)
(0 0.22 0.15)
(0 0.22 0.18)
(0 0.19 0.25)
(0 0.22 0.25)
);