StoveOpt/mesh_test/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;

vertices
(
(0 0 0)
(0 0.15 0)
(0 0 0.095)
(0 0.15 0.095)
(0 0 0.155)
(0 0.15 0.155)
(0 0 0.3)
(0 0.15 0.3)
(0 -0.04 0.3)
(0 0.19 0.3)
(0 -0.07 0.3)
(0 0.22 0.3)
(0 0 0.33)
(0 0.15 0.33)
(0 -0.04 0.33)
(0 0.19 0.33)
(0 -0.07 0.33)
(0 0.22 0.33)
(0 -0.04 0.4)
(0 0.19 0.4)
(0 -0.07 0.4)
(0 0.22 0.4)
(0 0 0.01)
(0 0.15 0.01)
(0 0 0.03)
(0 0.15 0.03)
(0 0.027 0)
(0 0.047 0)
(0 0.065 0)
(0 0.085 0)
(0 0.102 0)
(0 0.122 0)
(0 0.027 0.01)
(0 0.047 0.01)
(0 0.065 0.01)
(0 0.085 0.01)
(0 0.102 0.01)
(0 0.122 0.01)
(0 0.027 0.03)
(0 0.047 0.03)
(0 0.065 0.03)
(0 0.085 0.03)
(0 0.102 0.03)
(0 0.122 0.03)
(0.01 0 0)
(0.01 0.15 0)
(0.01 0 0.095)
(0.01 0.15 0.095)
(0.01 0 0.155)
(0.01 0.15 0.155)
(0.01 0 0.3)
(0.01 0.15 0.3)
(0.01 -0.04 0.3)
(0.01 0.19 0.3)
(0.01 -0.07 0.3)
(0.01 0.22 0.3)
(0.01 0 0.33)
(0.01 0.15 0.33)
(0.01 -0.04 0.33)
(0.01 0.19 0.33)
(0.01 -0.07 0.33)
(0.01 0.22 0.33)
(0.01 -0.04 0.4)
(0.01 0.19 0.4)
(0.01 -0.07 0.4)
(0.01 0.22 0.4)
(0.01 0 0.01)
(0.01 0.15 0.01)
(0.01 0 0.03)
(0.01 0.15 0.03)
(0.01 0.027 0)
(0.01 0.047 0)
(0.01 0.065 0)
(0.01 0.085 0)
(0.01 0.102 0)
(0.01 0.122 0)
(0.01 0.027 0.01)
(0.01 0.047 0.01)
(0.01 0.065 0.01)
(0.01 0.085 0.01)
(0.01 0.102 0.01)
(0.01 0.122 0.01)
(0.01 0.027 0.03)
(0.01 0.047 0.03)
(0.01 0.065 0.03)
(0.01 0.085 0.03)
(0.01 0.102 0.03)
(0.01 0.122 0.03)
(0 0.027 0.095)
(0 0.047 0.095)
(0 0.065 0.095)
(0 0.085 0.095)
(0 0.102 0.095)
(0 0.122 0.095)
(0 0.027 0.155)
(0 0.047 0.155)
(0 0.065 0.155)
(0 0.085 0.155)
(0 0.102 0.155)
(0 0.122 0.155)
(0 0.027 0.3)
(0 0.047 0.3)
(0 0.065 0.3)
(0 0.085 0.3)
(0 0.102 0.3)
(0 0.122 0.3)
(0 0.027 0.33)
(0 0.047 0.33)
(0 0.065 0.33)
(0 0.085 0.33)
(0 0.102 0.33)
(0 0.122 0.33)
(0.01 0.027 0.095)
(0.01 0.047 0.095)
(0.01 0.065 0.095)
(0.01 0.085 0.095)
(0.01 0.102 0.095)
(0.01 0.122 0.095)
(0.01 0.027 0.155)
(0.01 0.047 0.155)
(0.01 0.065 0.155)
(0.01 0.085 0.155)
(0.01 0.102 0.155)
(0.01 0.122 0.155)
(0.01 0.027 0.3)
(0.01 0.047 0.3)
(0.01 0.065 0.3)
(0.01 0.085 0.3)
(0.01 0.102 0.3)
(0.01 0.122 0.3)
(0.01 0.027 0.33)
(0.01 0.047 0.33)
(0.01 0.065 0.33)
(0.01 0.085 0.33)
(0.01 0.102 0.33)
(0.01 0.122 0.33)
(0 0.027 0.03)
(0.01 0.027 0.03)
(0 0.047 0.03)
(0.01 0.047 0.03)
(0 0.027 0.01)
(0.01 0.027 0.01)
(0 0.047 0.01)
(0.01 0.047 0.01)
(0 0.065 0.03)
(0.01 0.065 0.03)
(0 0.085 0.03)
(0.01 0.085 0.03)
(0 0.065 0.01)
(0.01 0.065 0.01)
(0 0.085 0.01)
(0.01 0.085 0.01)
(0 0.102 0.03)
(0.01 0.102 0.03)
(0 0.122 0.03)
(0.01 0.122 0.03)
(0 0.102 0.01)
(0.01 0.102 0.01)
(0 0.122 0.01)
(0.01 0.122 0.01)

);

blocks
(
hex (0 26 32 22 44 70 76 66) (5 5 5) simpleGrading (1 1 1) //LC EDITED
// previous 2 hex (26 27 33 32 70 71 77 76) (1 1 1) simpleGrading (1 1 1)
hex (26 27 142 140 70 71 143 141) (5 5 5) simpleGrading (1 1 1) //new 2
hex (27 28 34 33 71 72 78 77) (5 5 5) simpleGrading (1 1 1)
// old 4 hex (28 29 35 34 72 73 79 78) (1 1 1) simpleGrading (1 1 1)
hex (28 29 150 148 72 73 151 149) (5 5 5) simpleGrading (1 1 1) //new 4
hex (29 30 36 35 73 74 80 79) (5 5 5) simpleGrading (1 1 1)
// old  6 hex (30 31 37 36 74 75 81 80) (1 1 1) simpleGrading (1 1 1)
hex (30 31 158 156 74 75 159 157) (5 5 5) simpleGrading (1 1 1)
hex (31 1 23 37 75 45 67 81) (5 5 5) simpleGrading (1 1 1)
// old number 8 hex (22 32 38 24 66 76 82 68) (1 1 1) simpleGrading (1 1 1)
hex (22 140 136 24 66 141 137 68) (5 5 5) simpleGrading (1 1 1)
hex (32 33 39 38 76 77 83 82) (5 5 5) simpleGrading (1 1 1)
// old number 10 hex (33 34 40 39 77 78 84 83) (1 1 1) simpleGrading (1 1 1)
hex (142 148 144 138 143 149 145 139) (5 5 5) simpleGrading (1 1 1)
hex (34 35 41 40 78 79 85 84) (5 5 5) simpleGrading (1 1 1)
// old number 12 hex (35 36 42 41 79 80 86 85) (1 1 1) simpleGrading (1 1 1)
hex (150 156 152 146 151 157 153 147) (5 5 5) simpleGrading (1 1 1)
hex (36 37 43 42 80 81 87 86) (5 5 5) simpleGrading (1 1 1)
// old 14 hex (37 23 25 43 81 67 69 87) (1 1 1) simpleGrading (1 1 1)
hex (158 23 25 154 159 67 69 155) (5 5 5) simpleGrading (1 1 1)
hex (24 38 88 2 68 82 112 46) (5 5 5) simpleGrading (1 1 1)
hex (136 138 89 88 137 139 113 112) (5 5 5) simpleGrading (1 1 1)
// previous block 16 hex (38 39 89 88 82 83 113 112) (1 1 1) simpleGrading (1 1 1) // block 16

hex (39 40 90 89 83 84 114 113) (5 5 5) simpleGrading (1 1 1) //new 16
// old 18 hex (40 41 91 90 84 85 115 114) (1 1 1) simpleGrading (1 1 1)
hex (144 146 91 90 145 147 115 114) (5 5 5) simpleGrading (1 1 1) // new 18
hex (41 42 92 91 85 86 116 115) (5 5 5) simpleGrading (1 1 1)
// old 20 hex (42 43 93 92 86 87 117 116) (1 1 1) simpleGrading (1 1 1)
hex (152 154 93 92 153 155 117 116) (5 5 5) simpleGrading (1 1 1) // new 20
hex (43 25 3 93 87 69 47 117) (5 5 5) simpleGrading (1 1 1)
hex (2 88 94 4 46 112 118 48) (5 5 5) simpleGrading (1 1 1)
hex (88 89 95 94 112 113 119 118) (5 5 5) simpleGrading (1 1 1)
hex (89 90 96 95 113 114 120 119) (5 5 5) simpleGrading (1 1 1)
hex (90 91 97 96 114 115 121 120) (5 5 5) simpleGrading (1 1 1)
hex (91 92 98 97 115 116 122 121) (5 5 5) simpleGrading (1 1 1)
hex (92 93 99 98 116 117 123 122)(5 5 5) simpleGrading (1 1 1)
hex (93 3 5 99 117 47 49 123) (5 5 5) simpleGrading (1 1 1)
hex (4 94 100 6 48 118 124 50) (5 5 5) simpleGrading (1 1 1)
hex (94 95 101 100 118 119 125 124) (5 5 5) simpleGrading (1 1 1)
hex (95 96 102 101 119 120 126 125) (5 5 5) simpleGrading (1 1 1)
hex (96 97 103 102 120 121 127 126) (5 5 5) simpleGrading (1 1 1)
hex (97 98 104 103 121 122 128 127) (5 5 5) simpleGrading (1 1 1)
hex (98 99 105 104 122 123 129 128) (5 5 5) simpleGrading (1 1 1)
hex (99 5 7 105 123 49 51 129) (5 5 5) simpleGrading (1 1 1)
hex (16 14 18 20 60 58 62 64) (5 5 5) simpleGrading (1 1 1)
hex (10 8 14 16 54 52 58 60) (5 5 5) simpleGrading (1 1 1)
hex (8 6 12 14 52 50 56 58) (5 5 5) simpleGrading (1 1 1)
hex (6 100 106 12 50 124 130 56) (5 5 5) simpleGrading (1 1 1)
hex (100 101 107 106 124 125 131 130) (5 5 5) simpleGrading (1 1 1)
hex (101 102 108 107 125 126 132 131) (5 5 5) simpleGrading (1 1 1)
hex (102 103 109 108 126 127 133 132) (5 5 5) simpleGrading (1 1 1)
hex (103 104 110 109 127 128 134 133) (5 5 5) simpleGrading (1 1 1)
hex (104 105 111 110 128 129 135 134) (5 5 5) simpleGrading (1 1 1)
hex (105 7 13 111 129 51 57 135) (5 5 5) simpleGrading (1 1 1)
hex (7 9 15 13 51 53 59 57) (5 5 5) simpleGrading (1 1 1)
hex (9 11 17 15 53 55 61 59) (5 5 5) simpleGrading (1 1 1)
hex (15 17 21 19 59 61 65 63) (5 5 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

outlet_LHS
{
type patch;
faces
(
(20 18 62 64)
);
}

outlet_RHS
{
type patch;
faces
(
(19 21 65 63)
);
}

secondary_air_LHS
{
type patch;
faces
(
(2 46 48 4)
);
}

secondary_air_RHS
{
type patch;
faces
(
(3 47 49 5)
);
}

top_fuel
{
type patch;
faces
(
(38 39 83 82)
(40 41 85 84)
(42 43 87 86)
);
}

L_fuel
{
type patch;
faces
(
(32 76 82 38)
(34 78 84 40)
(36 80 86 42)
);
}

R_fuel
{
type patch;
faces
(
(33 77 83 39)
(35 79 85 41)
(37 81 87 43)
);
}

bottom_fuel
{
type patch;
faces
(
(32 33 77 76)
(34 35 79 78)
(36 37 81 80)
);
}

primary_inlets
{
type patch;
faces
(
(0 26 70 44)
(26 27 71 70)
(27 28 72 71)
(28 29 73 72)
(29 30 74 73)
(30 31 75 74)
(31 1 45 75)
);
}

stove_body
{
type patch;
faces
(
(0 44 66 22)
(22 66 68 24)
(24 68 46 2)
(4 48 50 6)
(8 6 50 52)
(10 8 52 54)
(10 54 60 16)
(16 60 64 20)
(14 58 62 18)
(14 12 56 58)
(12 106 130 56)
(106 107 131 130)
(107 108 132 131)
(108 109 133 132)
(109 110 134 133)
(110 111 135 134)
(111 13 57 135)
(13 15 59 57)
(15 59 63 19)
(17 61 65 21)
(11 55 61 17)
(9 11 55 53)
(7 9 53 51)
(5 49 51 7)
(25 69 47 3)
(23 67 69 25)
(1 45 67 23)
);
}

frontAndBack
{
type empty;
faces
(
(0 26 32 22)
// OLD (44 70 76 68)
(44 70 76 66)
// old (26 27 33 32)
(26 27 142 140)
// old (70 71 77 76)
(70 71 143 141)
(27 28 34 33)
(71 72 78 77)
//old (28 29 35 34)
(28 29 150 148)
// old (72 73 79 78)
(72 73 151 149)
(29 30 36 35)
(73 74 80 79)
// old (30 31 37 36)
(30 31 158 156)
// old (74 75 81 80)
(74 75 159 157)
(31 1 23 37)
(75 45 67 81)
// old (22 32 38 24)
(22 140 136 24)
// old (66 76 82 68)
(66 141 137 68)
(32 33 39 38)
(76 77 83 82)
// old (33 34 40 49)
(142 148 144 138)
// old (77 78 84 83)
(143 149 145 139)
(34 35 41 40)
(78 79 85 84)
// old (35 36 42 41)
(150 156 152 146)
// old (79 80 86 85)
(151 157 153 147)
(36 37 43 42)
(80 81 87 86)
// old (37 23 25 43)
(158 23 25 154)
// old (81 67 69 87)
(159 67 69 155)
(24 38 88 2)
(68 82 112 46)
// old (38 39 89 88)
(136 138 89 88)
// old (82 83 113 112)
(137 139 113 112)
(39 40 90 89)
(83 84 114 113)
// old (40 41 91 90)
(144 146 91 90)
// old (84 85 115 114)
(145 147 115 114)
(41 42 92 91)
(85 86 116 115)
// old (42 43 93 92)
(152 154 93 92)
// old (86 87 117 116)
(153 155 117 116)
(43 25 3 93)
(87 69 47 117)
(2 88 94 4)
(46 112 118 48)
(88 89 95 94)
(112 113 119 118)
(89 90 96 95)
(113 114 120 119)
(90 91 97 96)
(114 115 121 120)
(91 92 98 97)
(115 116 122 121)
(92 93 99 98)
(116 117 123 122)
(93 3 5 99)
(117 47 49 123)
(4 94 100 6)

(48 118 124 50)
(94 95 101 100)
(118 119 125 124)
(95 96 102 101)
(119 120 126 125)
(96 97 103 102)
(120 121 127 126)

(97 98 104 103)
(121 122 128 127)
(98 99 105 104)
(122 123 129 128)
(99 5 7 105)
(123 49 51 129)
(16 14 18 20)
(60 58 62 64)
(10 8 14 16)
(54 52 58 60)
(8 6 12 14)
(52 50 56 58)
(6 100 106 12)
(50 124 130 56)
(100 101 107 106)
(124 125 131 130)
(101 102 108 107)
(125 126 132 131)
(102 103 109 108)
(126 127 133 132)
(103 104 110 109)
(127 128 134 133)
(104 105 111 110)
(128 129 135 134)
(105 7 13 111)
(129 51 57 135)
(7 9 15 13)
(51 53 59 57)
(9 11 17 15)
(53 55 61 59)
(15 17 21 19)
(59 61 65 63)
);
}

);

mergePatchPairs
(
);

// ************************************************************************* //
