StoveOpt/mesh_test/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);
boundaryField
{
top_fuel
{
type fixedValue;
value uniform (0 0 0.25);
}
L_fuel
{
type fixedValue;
value uniform (0 -0.25 0);
}
R_fuel
{
type fixedValue;
value uniform (0 0.25 0); //left and right side fuel release
}
bottom_fuel
{
type noSlip; //for now...
}
primary_inlets
{
type fixedValue;
value uniform (0 0 0.00157079);
}
secondary_air_RHS
{
type fixedValue;
value uniform (0 -0.0033 0);
}
secondary_air_LHS
{
type fixedValue;
value uniform (0 0.0033 0);
}
outlet_LHS
{
type pressureInletOutletVelocity;
value $internalField;
}
outlet_RHS
{
type pressureInletOutletVelocity;
value $internalField;
}
frontAndBack
{
type empty;
}
stove_body
{
type noSlip;
}
}
// ************************************************************************* //